Revit 2027 API
BuiltInFailures.EditingFailures.CannotDeleteEditedElementError Property
 Can't delete element that is being edited.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDeleteEditedElementError { get; }
Public Shared ReadOnly Property CannotDeleteEditedElementError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDeleteEditedElementError {
	FailureDefinitionId^ get ();
}
static member CannotDeleteEditedElementError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace